"Hexademical value too long for numeric value (8 bytes max)" = "Hexademical value too long for numeric value (8 bytes max)";
"Hexadecimal string must have an even number of hex characters" = "Hexadecimal string must have an even number of hex characters";
